; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v5 - type_1 ?v2 - type_2)
 	      (pred_1 ?v8 - object ?v2 - type_2)
	      (pred_2 ?v5 - type_1 ?v7 - type_3)
	      (pred_4 ?v5 - type_1 ?v8 - object ?v7 - type_3))

   (:action op_3
       :parameters  (?v5 - type_1 ?v4 ?v1 - type_2)
       :precondition (and  (pred_3 ?v5 ?v4))
       :effect (and  (pred_3 ?v5 ?v1)
		     (not (pred_3 ?v5 ?v4))))

   (:action op_1
       :parameters (?v5 - type_1 ?v3 - object ?v6 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v6) (pred_3 ?v5 ?v6) (pred_2 ?v5 ?v7))
       :effect (and (pred_4 ?v5 ?v3 ?v7)
		    (not (pred_1 ?v3 ?v6)) 
		    (not (pred_2 ?v5 ?v7))))

   (:action op_2
       :parameters (?v5 - type_1 ?v3 - object ?v6 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v3 ?v7) (pred_3 ?v5 ?v6))
       :effect (and (pred_1 ?v3 ?v6)
		    (pred_2 ?v5 ?v7)
		    (not (pred_4 ?v5 ?v3 ?v7)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_1
obj_01 obj_07 - type_3
obj_03 obj_08 obj_06 - type_2
obj_09 obj_05 obj_04 - object)
(:init
(pred_3 obj_02 obj_06)
(pred_2 obj_02 obj_01)
(pred_2 obj_02 obj_07)
(pred_1 obj_09 obj_06)
(pred_1 obj_05 obj_06)
(pred_1 obj_04 obj_08)
)
(:goal
(and
(pred_1 obj_09 obj_03)
(pred_1 obj_05 obj_08)
(pred_1 obj_04 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_02 ?b obj_07))))
)
)

; plan
1. (op_1 obj_02 obj_09 obj_06 obj_01)
   deleted: (pred_1 obj_09 obj_06) (pred_2 obj_02 obj_01)
   added: (pred_4 obj_02 obj_09 obj_01)
   goals met: 0 of 3
2. (op_3 obj_02 obj_06 obj_03)
   deleted: (pred_3 obj_02 obj_06)
   added: (pred_3 obj_02 obj_03)
   goals met: 0 of 3
3. (op_2 obj_02 obj_09 obj_03 obj_01)
   deleted: (pred_4 obj_02 obj_09 obj_01)
   added: (pred_1 obj_09 obj_03) (pred_2 obj_02 obj_01)
   goals met: 1 of 3
4. (op_3 obj_02 obj_03 obj_08)
   deleted: (pred_3 obj_02 obj_03)
   added: (pred_3 obj_02 obj_08)
   goals met: 1 of 3
5. (op_1 obj_02 obj_04 obj_08 obj_01)
   deleted: (pred_1 obj_04 obj_08) (pred_2 obj_02 obj_01)
   added: (pred_4 obj_02 obj_04 obj_01)
   goals met: 1 of 3
6. (op_3 obj_02 obj_08 obj_06)
   deleted: (pred_3 obj_02 obj_08)
   added: (pred_3 obj_02 obj_06)
   goals met: 1 of 3
7. (op_2 obj_02 obj_04 obj_06 obj_01)
   deleted: (pred_4 obj_02 obj_04 obj_01)
   added: (pred_1 obj_04 obj_06) (pred_2 obj_02 obj_01)
   goals met: 2 of 3
8. (op_1 obj_02 obj_05 obj_06 obj_01)
   deleted: (pred_1 obj_05 obj_06) (pred_2 obj_02 obj_01)
   added: (pred_4 obj_02 obj_05 obj_01)
   goals met: 2 of 3
9. (op_3 obj_02 obj_06 obj_08)
   deleted: (pred_3 obj_02 obj_06)
   added: (pred_3 obj_02 obj_08)
   goals met: 2 of 3
10. (op_2 obj_02 obj_05 obj_08 obj_01)
   deleted: (pred_4 obj_02 obj_05 obj_01)
   added: (pred_1 obj_05 obj_08) (pred_2 obj_02 obj_01)
   goals met: 3 of 3
